<!DOCTYPE HTML PUBLIC "-//SoftQuad//DTD HoTMetaL PRO 4.0::19970714::extensions to HTML 4.0//EN"
 "hmpro4.dtd">

<HTML>
  <HEAD>
    <TITLE></TITLE>
  </HEAD>
  
  <BODY BACKGROUND="archivos/fondo.gif">
    <TABLE WIDTH="100%" BORDER="BORDER">
      <TR>
        <TD WIDTH="193" HEIGHT="690" VALIGN="TOP"><TABLE WIDTH="206" BORDER="6">
          <TR>
            <TD WIDTH="186"><IMG SRC="archivos/titulo.gif" ALIGN="MIDDLE" WIDTH="175" HEIGHT="40" ALT="{short description of image}"></TD>
          </TR>
        </TABLE>
        <P></P><TABLE WIDTH="206" BORDER="6" height="572" id="table1">
          <TR>
            <TD WIDTH="27" ALIGN="CENTER">1.</TD>
            <TD WIDTH="237" ALIGN="CENTER" height="32"><A HREF="index.html" TARGET="">Principal</A></TD>
          </TR>
          <tr>
            <TD WIDTH="27" ALIGN="CENTER">2.</TD>
            <TD WIDTH="237" ALIGN="CENTER" height="32"><a href="cajas.html">
			Cajas y Manuales SNES</a></TD>
          </tr>
          <TR>
            <TD WIDTH="27" ALIGN="CENTER" rowspan="12">3.</TD>
            <TD WIDTH="237" ALIGN="CENTER" height="32"><a href="proyectos.html">
			Proyectos</a></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
            <p align="left"><i>* <A HREF="chrono.html" TARGET="">Chrono Trigger</A></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="RIGHT" HEIGHT="32">
            <p align="left"><i>* <A HREF="mana.html" TARGET="">Secret of Mana</A></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="RIGHT" HEIGHT="32">
            <p align="left"><i>* <a href="seiken3.html">Secret of Mana 2</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="RIGHT" HEIGHT="32">
            <p align="left"><i>* <a href="tales.html">Tales of Phantasia</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="12">
            <p align="left"><i>* <a href="hunterg.html">Treasure Hunter G</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
            <p align="left">* <a href="rsaga3.html"><i>Romancing Saga 3</i></a></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
            <p align="left">* <i><a href="smrpg.html">Super Mario RPG</a></i></TD>
          </TR>
          <TR>
            <TD ALIGN="left" height="32">* <i><a href="ff6.html">Final Fantasy 6</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
            <p align="left">* <i><a href="so.html">Star Ocean</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
            <p align="left"><i>* <a href="soulblazer.html">SoulBlazer</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
            <p align="left"><i>* <a href="tsubasa_j.html">Captain Tsubasa J</a></i></TD>
          </TR>
          <TR>
            <TD WIDTH="27" ALIGN="CENTER">4.</TD>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
			<a href="docs.html">Documentación</a></TD>
          </TR>
          <TR>
            <TD WIDTH="27" ALIGN="CENTER">5.</TD>
            <TD WIDTH="237" ALIGN="CENTER" height="32">
			<a href="utilidades.html">Utilidades</a></TD>
          </TR>
          <TR>
            <TD WIDTH="27" ALIGN="CENTER">6.</TD>
            <TD WIDTH="237" ALIGN="CENTER" height="32"><a href="enlaces.html">Enlaces</a></TD>
          </TR>
        </TABLE>
        <P></P><TABLE WIDTH="205" BORDER="6">
          <TR>
            <TD ALIGN="CENTER" WIDTH="205"><IMG SRC="archivos/arroba.gif" ALIGN="MIDDLE" WIDTH="42" HEIGHT="42"></TD>
          </TR>
          <TR>
            <TD ALIGN="CENTER" WIDTH="205"><p>
			<a href="mailto:traducciones.magno@gmail.com">traducciones.magno@gmail.com</a><BR></TD>
          </TR>
        </TABLE>
	<BR><BR><BR>

	<BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR><BR>

	</TD><TD HEIGHT="690" WIDTH="807" VALIGN="TOP">
        <P>&nbsp;</P>
        <P ALIGN="CENTER">
		<FONT FACE="Times New Roman" SIZE="+1" COLOR="#FF0000"><B><U>
        STAR OCEAN al 100%</U></B></FONT>		</P>
        <p>&iexcl;&iexcl;Por fin tenemos aqu&iacute; la versi&oacute;n de 48 megas del juego!! Tras un par de a&ntilde;os de desarollo de la traducci&oacute;n, he conseguido por fin insertar todos los gr&aacute;ficos traducidos, para lo cual he tenido que mover todos los bloques de datos que forman la ROM para hacer hueco a los nuevos gr&aacute;ficos traducidos. Esto ha sido un reto bastante interesante porque ha supuesto mover m&aacute;s de 35000 bloques de datos con compresiones varias (LZ, Huffman, S-DD1 y datos sin comprimir de audio SPC. Cuando hace 2 a&ntilde;os empec&eacute; el proyecto, la idea era comprobar por qu&eacute; era tan dif&iacute;cil hacer la traducci&oacute;n como la gente dec&iacute;a y aprender un poco m&aacute;s acerca del chip S-DD1. La idea no era sacar un parche porque desde el principio asum&iacute; que si Dejap no hab&iacute;a podido insertar los gr&aacute;ficos traducidos al ingl&eacute;s por falta de espacio, lo mismo me iba a pasar a m&iacute;. As&iacute; que desde el principio la intenci&oacute;n era ir insertando lo que iba cambiando en una ROM expandida que pod&iacute;a ejecutar en el emulador Super Sleuth (gracias a nevksti por ella) e ir probando. Esto dej&eacute; de hacerlo muy pronto porque los cambios que insert&eacute; eran ENORMES y el proceso de inserci&oacute;n en SuperSleuth era tedioso, as&iacute; que cambi&eacute; de t&aacute;ctica: los cambios de c&oacute;digo los iba metiendo en la ROM japonesa de 48 megas para ir probando en emulador, pero los cambios en los gr&aacute;ficos los ten&iacute;a que hacer en una versi&oacute;n especial que sobreescrib&iacute;a datos de audio, ya que era la &uacute;nica manera de no buscar espacio libre en ROM para insertarlos y poder probarlos.</p>
        <p>As&iacute; que durante el desarrollo ten&iacute;a una ROM con los cambios de c&oacute;digo y otra con los cambios gr&aacute;ficos, pero nunca una con las dos cosas a la vez, por lo que decid&iacute; hacer mi propia versi&oacute;n expandida que no usaba la t&aacute;ctica de Neviksti: yo directamente fui cambiando m&aacute;s de 100 rutinas donde se hac&iacute;an descompresiones de gr&aacute;ficos y las fui sustituyendo por DMAs normales desde zonas expandidas de ROM. Pens&eacute; que as&iacute; conseguir&iacute;a una ROM de unos 64 megas que podr&iacute;a ser ejecutada en emuladores convencionales, y as&iacute; me evitaba lo de reordenar 35000 bloques de datos. Pero los c&aacute;lculos fallaron por 1.5 Megabits, y la ROM final expandida ocupaba 65.5Mbits, que s&iacute; funcionan perfectamente en un cartucho real. Ese cartucho real tiene un mapa de memoria especial que implement&eacute; en mis placas que no es compatible con otros mapas de memoria de otros cartuchos (ni SD2SNES ni otros flashcarts).</p>
        <p>Y as&iacute;, despu&eacute;s de mucho esfuerzo, he conseguido reubicar correctamente los 35000 bloques y, afortunadamente, ha habido espacio en la ROM de 48 megas para que quepan todos los gr&aacute;ficos en castellano y los subt&iacute;tulos de la intro, que estos ocupan bastante espacio.</p>
		<p><BR></p>
      <p><font color="#FF0000" size="5"><span style="background-color: #00FF00">Y por &uacute;ltimo una aclaraci&oacute;n muy 		importante.</span></font></p>
        <p>Este parche s&oacute;lo se puede aplicar a la ROM japonesa, que es en la que me he basado para hacer la traducci&oacute;n. La ROM con la traducci&oacute;n al ingl&eacute;s de Dejap no sirve. Y esta versi&oacute;n tampoco funciona en el hardware real, hasta donde yo s&eacute;.<u><strong></strong></u> No lo he probado as&iacute; que no puedo asegurarlo al 100%, aunque tampoco est&aacute; pensada para ello, sino para que se disfrute en un emulador. Si alguien quiere tener un cartucho con la traducci&oacute;n, que se ponga en contacto conmigo ya que tengo preparada una versi&oacute;n de 65.5Megabits que no necesita del chip especial S-DD1 que lleva la versi&oacute;n japonesa y con esa versi&oacute;n s&iacute; se puede jugar en el hardware real.</p>
        <p align="center">&nbsp;</p>
        <p align="center">&nbsp;</p>
      <p><i><b><font size="4" color="#0000FF">Versi&oacute;n 100%:</font></b></i></p>
        <p>La versi&oacute;n de 48 megas no ha sido intensivamente probada, pero la versi&oacute;n expandida de 65.5Mbits s&iacute;, por lo que por l&oacute;gica, la de 48 megas deber&iacute;a de funcionar. Sin embargo, a lo mejor alg&uacute;n bloque de datos se ha insertado mal y pudiera generar alg&uacute;n cuelgue. Al no presentarse nadie voluntario para hacer el betatesting hace unos meses, la versi&oacute;n no est&aacute; probada como a m&iacute; me gustar&iacute;a, pero deber&iacute;a funcionar.</p>
        <p><BR>
        </p>
        <TABLE WIDTH="807">
          <TR>
            <TD WIDTH="350">
            <p align="center">
            <p align="center">
            &nbsp;</TD>
            <TD VALIGN="MIDDLE" ALIGN="CENTER"><p><B>Letras Especiales:</B> 
              todos del castellano<BR>
              <BR>
              <B>Porcentaje
                Completado:</B> 100% <BR><BR>
              <B>Tama&ntilde;o Parche: </B>5 Megabytes</p>
              <p><b>Fecha Parche:</b> 04/08/2018<BR><BR>
                <B>Parche JP:</B> 
            <a href="archivos/RS3_Jap-Esp.rar">Star Ocean en castellano</a></p></TD>
          </TR>
        </TABLE><BR>
        <P></P><B><I>Lo que ya est&aacute; hecho:</I></B>
        <UL>
          <LI>Insertada la rutina para la fuente VWF.</LI>
          <LI>Nuevo algoritmo de compresi&oacute;n LZH que mejora el de Dejap</LI>
			<LI>Traducidos los subt&iacute;tulos de la intro</LI>
			<LI>Todos los carteles gr&aacute;ficos del juego est&aacute;n en castellano</LI>
        </UL>
        <BR><B><I>Lo que queda por hacer:</I></B><UL>
			<LI>Quiz&aacute; corregir alg&uacute;n di&aacute;logo o reubicar alg&uacute;n bloque de datos que no est&eacute; bien insertado. Pero eso lo dejaremos para la versi&oacute;n 100.1% ;)</LI>
        </UL>
</TD></TR>
      </TABLE>
    
    <P ALIGN="LEFT"></P>
    
    <P></P>
  </BODY>
</HTML>